InformationRegisters/ЗначенияСвойствОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияСвойствОбъектов</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.СвойстваОбъектов</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Свойство</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.СвойстваОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтатусыДоставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыДоставки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ТоварДоставляется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТоварПередан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТоварНеДоставлен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПереносДоставки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/ЗначенияСвойствОбъектов/Ext/RecordSetModule.bsl
Процедура ПриЗаписи(Отказ, Замещение)
	//+Сёмин Р. 17.11.2025 #UT10-5529
	Если НЕ Отказ Тогда
		ПроверитьНеобходимостьИПоместитьСтатусВОчередь();
	КонецЕсли;
	//-Сёмин Р. 17.11.2025 #UT10-5529
КонецПроцедуры

Процедура ПроверитьНеобходимостьИПоместитьСтатусВОчередь()
	//+Сёмин Р. 17.11.2025 #UT10-5529
	Если Константы.ЗаписыватьДанныеВРегистрСтатусыЗаказов.Получить() Тогда
		
		Для Каждого Стр Из ЭтотОбъект Цикл
			
			Если ТипЗнч(Стр.Объект) = Тип("ДокументСсылка.РеализацияТоваровУслуг")
				И Стр.Свойство = ПредопределенноеЗначение("ПланВидовХарактеристик.СвойстваОбъектов.СтатусДоставки")
				И Стр.Значение = Перечисления.СтатусыДоставки.ТоварПередан Тогда
				
				СтатусыЗаказов.ПоместитьВОчередьВФоне(Стр.Объект);
				
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	//-Сёмин Р. 17.11.2025 #UT10-5529
КонецПроцедуры
